{
  "projects": [
    {
      "title": "UniMap",
      "stack": "Swift, SwiftUI, FastAPI",
      "description": "UniMap is an iOS application designed to bring UTSC students closer together, providing a hub for all events on campus. Developed a user event upload functionality on a Swift iOS application using MVVM architecture, implementing form validation, custom feedback patterns, focus-state control, and dynamic styling for a smooth user experience.",
      "img": "unimap.png",
      "url": "https://github.com/Whooses/Unimap"
    },
    {
      "title": "Calendrier",
      "stack": "Swift, PencilKit, SwiftData, Rive",
      "description": "Calendrier is an iOS-based note-taking application using SwiftData (for data persistence), providing users with a clean and simple (yet cute!) interface for managing text and drawing notes. Utilized Swiftdata for data persistence, while maintaining a unique, accessible UI.",
      "img": "calendrier.png",
      "url": "https://github.com/kr1shap/calendrier"
    },
    {
      "title": "WellGlobe | TerraHacks 25'",
      "stack": "React, Typescript, FastAPI, Gemini",
      "description": "A smart travel health companion that gives you real-time advisories, vaccine checklists, and personalized safety tips so you can explore the world confidently and safely.",
      "img": "wg.png",
      "url": "https://devpost.com/software/wellglobe"
    },
    {
      "title": "Fireboy and Watergirl",
      "stack": "Java, Java Swing API",
      "description": "Implementation of Fireboy and Watergirl puzzle-platformer, with javax.swing library. This project recreates the mechanics of the original game with multiple levels, cooperative character control, collectible diamonds, and enemies, using classes, threads, Java Swing API, and OOP logic.",
      "img": "firewater.png",
      "url": "https://github.com/kr1shap/fireboy-watergirl"
    },
    {
      "title": "EateryCrit",
      "stack": "React, TailwindCSS + Flask, SQLite/SQLAlchemy",
      "description": "A dynamic restaurant review web application built with React, TailwindCSS, Framer Motion, and TypewriterJS on the frontend, with a Flask + SQL backend handling user authentication, ratings, and AI-generated images (images in the future!). Users can browse restaurants and submit ratings. The app features smooth animations and a responsive design.",
      "img": "eaterycritt.png",
      "url": "https://github.com/kr1shap/eaterycritt"
    },
    {
      "title": "Async Battleship",
      "stack": "C, [Node.js (in the future!)]",
      "description": "An asynchronous C server for Battleship using select(), non-blocking I/O, and socket programming to handle multiple concurrent clients with robust error handling.",
      "img": "async_ship.png",
      "url": "https://github.com/kr1shap/async-battleship"
    },
    {
      "title": "Tetris | MIPS32 Assembly",
      "stack": "Assembly, lots of patience",
      "description": "Implemented a simplified version of the classic Tetris game using MIPS assembly. Features real-time piece movement, rotation, collision detection, line clearing, and score tracking, all rendered on a memory-mapped framebuffer. Optimized low-level logic and display routines to handle game state updates efficiently on limited hardware.",
      "img": "tetris.png",
      "url": "https://github.com/kr1shap/tetris-assembly"
    }
    
  ],
  "experience": [
    {
      "title": "Web Dev @ BizZone Inc.",
      "description": "∙Evaluated client websites against appropriate standards \n ∙Designed Figma bootstrap elements and concepts for clients",
      "img": "https://d2q79iu7y748jz.cloudfront.net/s/_logo/ccfa256d196e5e73331612529de95104"
    },
    {
      "title": "RBC Tech@Advisory Program '25",
      "description": "Accepted from a highly competitive and impressive canidate pool to take part in the 2025 Tech@RBC Women's Advisory Program. Benefit from mentorship and development opportunities.",
      "img": "rbclogo.webp"
    },
    {
      "title": "Graphics Director / FYR @ WICSM",
      "description": "Promoting equity and fairness in computer science! Structured monthly social events involving snacks and activities to increase student participation. As well, created eye-captivating posters resulting in an increased turnout",
      "img": "https://www.utsc.utoronto.ca/cms/sites/utsc.utoronto.ca.cms/files/styles/3_1_full_width_banner/public/images/page/Student%20clubs%201600x%283%29.png?h=d82dd7ab&itok=KAY2l-Mz"
    },
    {
      "title": "Graphics Director @ GDG",
      "description": "Designing graphics for Google Developer Club Scarbrough",
      "img": "https://www.utsc.utoronto.ca/cms/sites/utsc.utoronto.ca.cms/files/styles/3_1_full_width_banner/public/images/page/Header%20image%201600x%20.jpg?h=d82dd7ab&itok=XT8-EA-G"
    },
    {
      "title": "Graphic Design Assoc @ UTMIST",
      "description": "Working with director and VP marketing to design visually-appealing graphics for UTMIST brand.",
      "img": "https://www.utmist.ca/_next/static/media/utmist-logo-large.f1a7b56c.svg"
    }
  ]
}
